---
type: RoomTagFilter
namespace: Autodesk.Revit.DB.Architecture
version: 2024
members: 2
tags: [revit-api, class]
---

# RoomTagFilter

`Autodesk.Revit.DB.Architecture.RoomTagFilter` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | RoomTagFilter | — | `public RoomTagFilter ()` |
| Method | PassesFilter | — | `` |